import React from "react";
import "./App.css";

function App() {
  // const age = 18;

  // const isAuth = true;

  // const isAuth = false;
  
  return (
    <>
      {/* {age>18? <p>yes</p>:<p>no</p>}
Если в age записано больше 18 лет, то в тексте тега div покажите пользователю абзац с одним текстом, а если меньше - то с другим. */}

      {/* {isAuth && 	<p>вы авторизованы</p>}
Сделайте так, чтобы приведенный абзац с текстом показывался только если в isAuth записано true. */}

      {/* {!isAuth && <p>пожалуйста, авторизуйтесь</p>}
      Сделайте так, чтобы приведенный абзац с текстом показывался только если в isAuth записано false. */}

    </>
  );
}

export default App;
